In [2]:
import pandas as pd
import numpy as np

In [ ]:
# Catenating datasets

In [7]:
# Helper function to create DataFrames

def makedf(cols, ind):
    data = {c : [str(c) + str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [8]:
a=makedf("AB", [0,1])
a

    A   B
0  A0  B0
1  A1  B1

In [9]:
b = makedf("AB", [2,3])
b

    A   B
2  A2  B2
3  A3  B3

In [10]:
c = makedf("CD", [0,1])
c

    C   D
0  C0  D0
1  C1  D1

In [12]:
d = makedf("BC", [2,3])
d

    B   C
2  B2  C2
3  B3  C3

In [14]:
pd.concat([a,b])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [17]:
# creates duplicate indices
r = pd.concat([a,a])
r

    A   B
0  A0  B0
1  A1  B1
0  A0  B0
1  A1  B1

In [19]:
# Three solutions to this:

# Firstly, deny creation of duplicated indices by giving the verify_integrity parameter 
# to the concat function:

try:
    pd.concat([a,a], verify_integrity=True)
except ValueError as e:
    import sys
    print(e, file=sys.stderr)

Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [20]:
# Secondly, we can ask for automatic renumbering of rows:

pd.concat([a,a], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A0  B0
3  A1  B1

In [21]:
"""Thirdly, we can ask for hierarchical indexing. The indices can contain multiple levels, 
but on this course we donâ€™t consider hierarchical indices in detail. Hierarchical indices 
can make a two dimensional array to work like higher dimensional array."""

r2=pd.concat([a,a], keys=['first', 'second'])
r2

           A   B
first  0  A0  B0
       1  A1  B1
second 0  A0  B0
       1  A1  B1

In [22]:
r2["A"]["first"][0]

'A0'

In [24]:
# catenating horizontally

pd.concat([a,c], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [25]:
# sort option is used to silence a deprecation message

pd.concat([a,d], sort=False)

     A   B    C
0   A0  B0  NaN
1   A1  B1  NaN
2  NaN  B2   C2
3  NaN  B3   C3

In [ ]:
"""It expanded the non-existing cases with NaNs. This method is called an outer join, 
which forms the union of columns in the two DataFrames."""

In [26]:
# The alternative is inner join, which forms the intersection of columns:

pd.concat([a,d], join="inner")

    B
0  B0
1  B1
2  B2
3  B3

In [3]:
# Merging dataframes

df = pd.DataFrame([[1000, "Jack", 21], [1500, "John", 29]], columns=["Wage", "Name", "Age"])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29

In [4]:
df2 = pd.DataFrame({"Name" : ["John", "Jack"], "Occupation": ["Plumber", "Carpenter"]})
df2

   Name Occupation
0  John    Plumber
1  Jack  Carpenter

In [5]:
# merging the two DataFrames on their common field, and, importantly,
# will keep the indices aligned.

pd.merge(df, df2)

   Wage  Name  Age Occupation
0  1000  Jack   21  Carpenter
1  1500  John   29    Plumber

In [6]:
df3 = pd.concat([df2, pd.DataFrame({ "Name" : ["James"], "Occupation":["Painter"]})], ignore_index=True)
df3

    Name Occupation
0   John    Plumber
1   Jack  Carpenter
2  James    Painter

In [7]:
# By default an inner join is computed
pd.merge(df, df3)

   Wage  Name  Age Occupation
0  1000  Jack   21  Carpenter
1  1500  John   29    Plumber

In [8]:
# Outer join
pd.merge(df, df3, how="outer")

     Wage   Name   Age Occupation
0  1000.0   Jack  21.0  Carpenter
1  1500.0   John  29.0    Plumber
2     NaN  James   NaN    Painter

In [9]:
books = pd.DataFrame({"Title" : ["War and Peace", "Good Omens", "Good Omens"] ,
                      "Author" : ["Tolstoi", "Terry Pratchett", "Neil Gaiman"]})
books

           Title           Author
0  War and Peace          Tolstoi
1     Good Omens  Terry Pratchett
2     Good Omens      Neil Gaiman

In [10]:
collections = pd.DataFrame([["Oodi", "War and Peace"],
                           ["Oodi", "Good Omens"],
                           ["Pasila", "Good Omens"],
                           ["Kallio", "War and Peace"]], columns=["Library", "Title"])
collections

  Library          Title
0    Oodi  War and Peace
1    Oodi     Good Omens
2  Pasila     Good Omens
3  Kallio  War and Peace

In [ ]:

libraries_with_books_by = pd.merge(books, collections)
libraries_with_books_by